<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from archives.limsi.fr/Individu/habert/Cours/05-06/DocumentStructure/Cours3/QueneauConteAVotreFacon.html by HTTrack Website Copier/3.x [XR&CO'2010], Sun, 22 Jan 2012 03:37:50 GMT -->
<head>
  <title>QUENEAU</title>
</head>
<body>
<p><i>Ce texte soumis &agrave; la 83e r&eacute;union de travail de
l'Ouvroir de Litt&eacute;rature Potentielle, s'inspire de la
pr&eacute;-
entation des instructions destin&eacute;es aux ordinateurs ou bien
encore de l'enseignement programm&eacute;. C'est une structure analogue
&agrave; la litt&eacute;rature "en arbre" propos&eacute;e par F. Le
Lionnais &agrave; la 79<sup>e</sup> r&eacute;union.</i></p>
<ol>
  <li>D&eacute;sirez-vous conna&icirc;tre l'histoire des trois alertes
petits pois ?<br>
Si oui, passez &agrave; 4,<br>
si non, passez &agrave; 2. </li>
  <li>Pr&eacute;f&eacute;rez-vous celle des trois minces grands
&eacute;chalas ?<br>
Si oui, passez &agrave; 16,<br>
si non, passez &agrave; 3. </li>
  <li>Pr&eacute;f&eacute;rez-vous celle des trois moyens
m&eacute;diocres arbustes ?<br>
Si oui, passez &agrave; 17,<br>
si non, passez &agrave; 21. </li>
  <li>Il y avait une fois trois petits pois v&ecirc;tus de vert qui
dormaient gentiment dans leur cosse. Leur visage
bien rond respirait par les trous de leurs narines et l'on entendait
leur ronflement doux et harmonieux.<br>
Si vous pr&eacute;f&eacute;rez une autre description, passez &agrave; 9,<br>
si celle-&ccedil;i vous convient, passez &agrave; 5. </li>
  <li>Ils ne r&ecirc;vaient pas. Ces petits &ecirc;tres en effet ne
r&ecirc;vent jamais.<br>
Si vous pr&eacute;f&eacute;rez qu'ils r&ecirc;vent, passez &agrave; 6,<br>
sinon, passez &agrave; 7. </li>
  <li>Ils r&ecirc;vaient. Ces petits &ecirc;tres en effet r&ecirc;vent
toujours et leurs nuits s&eacute;cr&egrave;tent des songes charmants.<br>
si vous d&eacute;sirez conna&icirc;tre ces songes, passez &agrave; 11,<br>
si vous n'y tenez pas, vous passez &agrave; 7. </li>
  <li>Leurs pieds mignons trempaient dans de chaudes chaussettes et ils
portaient au lit des gants de velours noir.<br>
Si vous pr&eacute;f&eacute;rez des gants d'une autre couleur, passez
&agrave; 8,<br>
si cette couleur vous convient, passez &agrave; 10. </li>
  <li>Ils portaient au lit des gants de velours bleu.<br>
Si vous pr&eacute;f&eacute;rez des gants d'une autre couleur, passez
&agrave; 7,<br>
si cette couleur vous convient, passez &agrave; 10. </li>
  <li>Il y avait une fois trois petits pois qui roulaient leur bosse
sur les grands chemins. Le soir venu, fatigu&eacute;s et las, ils
s'endormirent tr&egrave;s rapidement.<br>
Si vous d&eacute;sirez conna&icirc;tre la suite, passez &agrave; 5,<br>
si non, passez &agrave; 21. </li>
  <li>Tous les trois faisaient le m&ecirc;me r&ecirc;ve, ils s'aimaient
en effet tendrement et, en bons fiers trumeaux, songeaient toujours
semblablement.<br>
Si vous d&eacute;sirez conna&icirc;tre leur r&ecirc;ve, passez &agrave;
11,<br>
si non, passez &agrave; 12. </li>
  <li>Ils r&ecirc;vaient qu'ils allaient chercher leur soupe &agrave;
la cantine populaire et qu'en ouvrant leur gamelle ils
d&eacute;couvraient que c'&eacute;tait de la soupe d'ers. D'horreur,
ils s'&eacute;veillent.<br>
Si vous voulez savoir pourquoi ils s'&eacute;veillent d'horreur,
consulter le Larousse au mot "ers" et n'en parlons plus,<br>
si vous jugez inutile d'approfondir la question, passez &agrave; 12. </li>
  <li>Opopo&iuml; ! s'&eacute;crient-ils en ouvrant les yeux.
Opopo&iuml; ! quel songe avons-nous enfant&eacute; l&agrave; ! Mauvais
pr&eacute;sage, dit le premier. Oui-da, dit le second, c'est bien vrai,
me voil&agrave; triste. Ne vous troublez pas ainsi, dit le
troisi&egrave;me qui &eacute;tait le plus fut&eacute;, il ne s'agit pas
de s'&eacute;mouvoir, mais de comprendre, bref, Je m'en vais vous
analyser &ccedil;a.<br>
Si vous d&eacute;sirez conna&icirc;tre tout de suite
l'interpr&eacute;tation de ce songe, passez &agrave; 15,<br>
si vous souhaitez au contraire conna&icirc;tre les r&eacute;actions des
deux autres, passez &agrave; 13. </li>
  <li>Tu nous la bailles belle, dit le premier. Depuis quand sais-tu
analyser les songes? Oui, depuis quand ? ajouta le second.<br>
Si vous d&eacute;sirez aussi savoir depuis quand, passez &agrave; 14,<br>
si non, passez &agrave; 14 tout de m&ecirc;me, car vous ne le saurez
pas plus. </li>
  <li>Depuis quand? s'&eacute;cria le troisi&egrave;me. Est-ce
que je sais moi! Le fait est que je pratique la chose. Vous allez voir !<br>
Si vous voulez aussi voir, passez &agrave; 15,<br>
si non, passez &eacute;galement &agrave; 15, car vous ne verrez rien. </li>
  <li>Eh bien! voyons, dirent ses fr&egrave;res. Votre ironie ne ne me
pla&icirc;t pas, r&eacute;pliqua l'autre, et vous ne saurez rien.<br>
D'ailleurs, au cours de cette conversation d'un ton assez vif,
votre sentiment d'horreur ne s'est-il pas estomp&eacute; ?
effac&eacute; m&ecirc;me? Alors &agrave; quoi bon remuer le bourbier de
votre inconscient de papilionac&eacute;es? Allons plut&ocirc;t nous
laver &agrave; la fontaine et saluer ce gai matin dans l'hygi&egrave;ne
et la sainte euphorie! Aussit&ocirc;t dit, aussit&ocirc;t fait : les
voil&agrave; qui se glissent hors de leur cosse, se laissent doucement
rouler sur le sol et puis au petit trot gagnent joyeusement le
th&eacute;&acirc;tre de leurs ablutions.<br>
Si vous d&eacute;sirez savoir ce qui se passe sur le
th&eacute;&acirc;tre de leurs ablutions, passez &agrave; 16,<br>
si vous ne le d&eacute;sirez pas, vous passez &agrave; 21. </li>
  <li>Trois grands &eacute;chalas les regardaient faire.<br>
Si les trois grands &eacute;chalas vous d&eacute;plaisent, passez
&agrave; 21,<br>
s'ils vous conviennent, passez &agrave; 18. </li>
  <li>Trois moyens m&eacute;diocres arbustes les regardaient faire.<br>
Si les trois moyens m&eacute;diocres arbustes vous d&eacute;plaisent,
passez &agrave; 21,<br>
s'ils vous conviennent, passez &agrave; 18. </li>
  <li>Se voyant ainsi zyeut&eacute;s, les trois alertes petits pois qui
&eacute;taient fort pudiques s'ensauv&egrave;rent.<br>
Si vous d&eacute;sirez savoir ce qu'ils firent ensuite, passez &agrave;
19,<br>
si vous ne le d&eacute;sirez pas, vous passez &agrave; 21. </li>
  <li>Ils coururent bien fort pour regagner leur cosse et, refermant
celle-ci derri&egrave;re eux, s'y endormirent de nouveau.<br>
Si vous d&eacute;sirez conna&icirc;tre la suite, passez &agrave; 20,<br>
si vous ne le d&eacute;sirez pas, vous passez &agrave; 21. </li>
  <li>Il n'y a pas de suite le conte est termin&eacute;. </li>
  <li>Dans ce cas, le conte est &eacute;galement termin&eacute;. </li>
  <br>
  <br>
Raymond Queneau. <br>
  <i>Source : OuLiPo <span style="font-weight: bold;">La
litt&eacute;rature potentielle</span>, Gallimard,
Id&eacute;es, Paris, 1973, p. 277.</i>
</ol>
</body>

<!-- Mirrored from archives.limsi.fr/Individu/habert/Cours/05-06/DocumentStructure/Cours3/QueneauConteAVotreFacon.html by HTTrack Website Copier/3.x [XR&CO'2010], Sun, 22 Jan 2012 03:37:50 GMT -->
</html>
